# IFCProperty Mapping Info Is Valid Mapping Info Method

Source: https://www.revitapidocs.com/2026/6f5dc519-9d05-6355-bc9f-462125a6e347.htm

---

| IFCProperty Mapping Info Is Valid Mapping Info Method |
| --- |

Defines whether the mapping info contains meaningful data.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsValidMappingInfo(
	IFCPropertyMappingInfo mappingInfo
)
```

```
Public Shared Function IsValidMappingInfo (
	mappingInfo As IFCPropertyMappingInfo
) As Boolean
```

```
public:
static bool IsValidMappingInfo(
	IFCPropertyMappingInfo^ mappingInfo
)
```

```
static member IsValidMappingInfo :
        mappingInfo : IFCPropertyMappingInfo -> bool
```

#### Parameters

mappingInfo IFCPropertyMappingInfo
:   The mapping info

#### Return Value

Boolean
Whether or not the mapping info is valid. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace